#language: ru

Функционал: Создание нового таска

  Сценарий: Создание нового таска
    Допустим я захожу на страницу логина
    Если я ввожу в поле "username" значение "admin"
    И я ввожу в поле "password" значение "admin"
    И нажимаю на кнопку "Войти"
    И я вижу сообщение об успешном логине
    И я перехожу на задачу "Создать задачу"
    И я вижу форму создания таска
    И я выбираю ползователя "user1"
    И я ввожу в поле добаления таска "title" значение "что-то сделать"
    И я ввожу в поле добаления таска "description" значение "надо сделать"
    И я выбираю категорию "Ручной труд"
#    И я выбираю дату
#    И добавляю пользователя "Добавить"

#  Сценарий: Создание нового пользователя с правами администратор
#    Допустим я захожу на страницу логина
#    Если я ввожу в поле "username" значение "admin"
#    И я ввожу в поле "password" значение "admin"
#    И нажимаю на кнопку "Войти"
#    И я вижу сообщение об успешном логине
#    И я перехожу по ссылке "Создать пользователя"
#    И я вижу форму создания пользователя
#    И я ввожу в поле добаления пользователя "username" значение "user133"
#    И я ввожу в поле добаления пользователя "password" значение "admin"
#    И я выбираю роль ползователя "Администратор"
#    И добавляю пользователя "Добавить"
